# Recommendation Systems

√ñneri sistemleri, kullanƒ±cƒ±larƒ±n ge√ßmi≈ü davranƒ±≈ülarƒ±nƒ± ve tercihlerini analiz ederek onlara ki≈üiselle≈ütirilmi≈ü i√ßerik √∂neren makine √∂ƒürenmesi algoritmalarƒ±dƒ±r. Bu sistemler, Netflix'in izleme √∂nerileri, Spotify'ƒ±n m√ºzik √∂nerileri, Amazon‚Äôun √ºr√ºn tavsiyeleri ve YouTube‚Äôun video √∂nerileri gibi bir√ßok alanda kullanƒ±lƒ±r.

## √ñneri Sistemleri T√ºrleri
√ñneri sistemleri 3 ana kategoriye ayrƒ±lƒ±r:

### 1- ƒ∞√ßerik Tabanlƒ± Filtreleme (Content-Based Filtering):
Kullanƒ±cƒ±ya √∂neriler sunmak i√ßin, kendi ge√ßmi≈ü etkile≈üimleri ve i√ßerik √∂zellikleri kullanƒ±lƒ±r.

√ñneriler, kullanƒ±cƒ±nƒ±n daha √∂nce beƒüendiƒüi veya ilgilendiƒüi √∂ƒüelerin √∂zelliklerine dayalƒ± olarak olu≈üturulur.

√ñzellikle √ºr√ºn veya i√ßerik √∂zelliklerinin belirgin olduƒüu senaryolarda etkilidir (√∂rneƒüin, filmler, kitaplar, ≈üarkƒ±lar).

‚úÖ Avantajlarƒ±:

‚úî Kullanƒ±cƒ±nƒ±n ki≈üisel tercihlerini daha iyi anlamaya yardƒ±mcƒ± olur.

‚úî Yeni ve pop√ºler olmayan i√ßerikleri de √∂nerebilir.

‚ùå Dezavantajlarƒ±:

‚úñ Kullanƒ±cƒ± ge√ßmi≈üi yeterli deƒüilse √∂neriler iyi √ßalƒ±≈ümaz (Cold Start Problem).

‚úñ Sadece benzer √∂zellikteki i√ßerikleri √∂nerdiƒüi i√ßin √ße≈üitlilik d√º≈üebilir (Filter Bubble Problem).

### 2- ƒ∞≈übirlik√ßi Filtreleme (Collaborative Filtering):

Kullanƒ±cƒ±larƒ±n ge√ßmi≈ü etkile≈üimlerini ve diƒüer kullanƒ±cƒ±larƒ±n tercihlerinden elde edilen bilgileri kullanarak √∂neriler sunar.

Kullanƒ±cƒ±larƒ±n davranƒ±≈ülarƒ±na dayalƒ± olarak √ßalƒ±≈üƒ±r, yani kullanƒ±cƒ±lar arasƒ± benzerlik veya √ºr√ºnler arasƒ± benzerlik kullanƒ±lƒ±r.

 √ñrnek:
Spotify‚Äôda seninle benzer m√ºzikleri dinleyen kullanƒ±cƒ±larƒ±n listelerini analiz ederek, senin hen√ºz dinlemediƒüin ama onlarƒ±n dinlediƒüi ≈üarkƒ±larƒ± √∂nerebilir.

üìå ƒ∞ki T√ºr ƒ∞≈übirlik√ßi Filtreleme Y√∂ntemi Vardƒ±r:

#### Kullanƒ±cƒ±-Temelli ƒ∞≈übirlik√ßi Filtreleme (User-Based Collaborative Filtering):

Kullanƒ±cƒ±larƒ±n benzer tercihleri varsa, onlara birbirinin tercihlerine dayalƒ± √∂neriler yapƒ±lƒ±r.

√ñrnek: Seninle aynƒ± filmleri izleyen biri bir filmi beƒüendiyse, sana da o film √∂nerilir.

#### √ñƒüe-Temelli ƒ∞≈übirlik√ßi Filtreleme (Item-Based Collaborative Filtering)

Belirli bir √∂ƒüeyi beƒüenen kullanƒ±cƒ±lar, ba≈üka hangi √∂ƒüeleri beƒüendiyse o √∂ƒüeler √∂nerilir.

√ñrnek: Amazon‚Äôda belirli bir √ºr√ºn√º satƒ±n alan m√º≈üteriler, ba≈üka hangi √ºr√ºnleri satƒ±n aldƒ±ysa sana da o √ºr√ºn √∂nerilir.

‚úÖ Avantajlarƒ±:

‚úî Kullanƒ±cƒ±nƒ±n i√ßerik hakkƒ±nda hi√ßbir bilgisi olmasa bile √∂neriler olu≈üturulabilir.

‚úî Daha fazla √ße≈üitlilik saƒülayarak farklƒ± t√ºrde √∂neriler sunabilir.

‚ùå Dezavantajlarƒ±:

‚úñ Yeni kullanƒ±cƒ±lar veya yeni √ºr√ºnler i√ßin yeterli veri yoksa √∂neri yapmak zor olur (Cold Start Problem).

‚úñ B√ºy√ºk √∂l√ßekli sistemlerde hesaplama maliyetli olabilir.

# 3- Hibrit (Hybrid) √ñneri Sistemleri
ƒ∞√ßerik Tabanlƒ± Filtreleme + ƒ∞≈übirlik√ßi Filtreleme y√∂ntemlerini birle≈ütirerek √∂neriler sunar.
B√∂ylece her iki y√∂ntemin de g√º√ßl√º y√∂nlerinden faydalanƒ±lƒ±r.

üîπ √ñrnek:
Netflix i√ßerik tabanlƒ± ve i≈übirlik√ßi filtreleme y√∂ntemlerini birle≈ütirerek √∂neriler sunar. Kullanƒ±cƒ±nƒ±n izlediƒüi filmlerin t√ºr√ºne bakarak i√ßerik tabanlƒ± √∂neri yapar, aynƒ± zamanda benzer zevke sahip kullanƒ±cƒ±larƒ±n izlediƒüi filmleri de √∂nerir.


‚úÖ Avantajlarƒ±:

‚úî Daha doƒüru ve ki≈üiselle≈ütirilmi≈ü √∂neriler sunar.

‚úî Cold Start Problem'ini hafifletebilir.

In [1]:
import numpy as np
import pandas as pd

In [3]:
column_names=["user_id","item_id","rating","timestamp"]
df=pd.read_csv("users.data",sep="\t",names=column_names)
df.head()

   user_id  item_id  rating  timestamp
0        0       50       5  881250949
1        0      172       5  881250949
2        0      133       1  881250949
3      196      242       3  881250949
4      186      302       3  891717742

In [5]:
# kayƒ±t sayƒ±sƒ±
len(df)

100003

In [7]:
movie_titles=pd.read_csv("movie_id_titles.csv")
movie_titles.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [8]:
# kayƒ±t sayƒ±sƒ±
len(movie_titles)

1682

In [10]:
# veri tabanƒ± i≈ülemlerindeki join e benzer ≈üekilde merge ederek verileri birle≈ütireceƒüiz.
df=pd.merge(df,movie_titles,on="item_id")
df.head()

   user_id  item_id  rating  timestamp                            title
0        0       50       5  881250949                 Star Wars (1977)
1        0      172       5  881250949  Empire Strikes Back, The (1980)
2        0      133       1  881250949        Gone with the Wind (1939)
3      196      242       3  881250949                     Kolya (1996)
4      186      302       3  891717742         L.A. Confidential (1997)

## Recommendation Sisteminin kurulmasƒ±

In [15]:
moviemat=df.pivot_table(index="user_id",columns="title",values="rating")
moviemat.head()
# bu i≈ülem Kullanƒ±cƒ±larƒ±n belirli filmlere verdiƒüi puanlarƒ± bir matris formatƒ±nda d√ºzenleyerek, film-film veya kullanƒ±cƒ±-kullanƒ±cƒ± benzerlikleri hesaplamak i√ßin kullanƒ±lƒ±r.
#Bazƒ± kullanƒ±cƒ±lar her filmi oylamadƒ±ƒüƒ± i√ßin, NaN olan eksik puanlarƒ± daha sonra ortalama ile doldurabiliriz.

title,'Til There Was You (1997),1-900 (1994),101 Dalmatians (1996),12 Angry Men (1957),187 (1997),2 Days in the Valley (1996),"20,000 Leagues Under the Sea (1954)",2001: A Space Odyssey (1968),3 Ninjas: High Noon At Mega Mountain (1998),"39 Steps, The (1935)",...,Yankee Zulu (1994),Year of the Horse (1997),You So Crazy (1994),Young Frankenstein (1974),Young Guns (1988),Young Guns II (1990),"Young Poisoner's Handbook, The (1995)",Zeus and Roxanne (1997),unknown,√Å k√∂ldum klaka (Cold Fever) (1994)
user_id,,,,,,,,,,,,,,,,,,,,,
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,2.0,5.0,NaN,NaN,3.0,4.0,NaN,NaN,...,NaN,NaN,NaN,5.0,3.0,NaN,NaN,NaN,4.0,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [16]:
type(moviemat)

pandas.core.frame.DataFrame

In [19]:
star_wars_raitings=moviemat["Star Wars (1977)"]
star_wars_raitings.head()

user_id
0    5.0
1    5.0
2    5.0
3    NaN
4    5.0
Name: Star Wars (1977), dtype: float64

Ama√ß starwars filmine benzer film √∂nerileri yapacaƒüƒ±z.

In [21]:
# corrwith() metodu kullanarak StarWars filimi ile korelasyonlarƒ± hesaplayalƒ±m.
similar_to_starwars=moviemat.corrwith(star_wars_raitings)
similar_to_starwars

C:\Users\yigit\anaconda3\Lib\site-packages\numpy\lib\function_base.py:2897: RuntimeWarning: invalid value encountered in divide
  c /= stddev[:, None]
C:\Users\yigit\anaconda3\Lib\site-packages\numpy\lib\function_base.py:2898: RuntimeWarning: invalid value encountered in divide
  c /= stddev[None, :]
C:\Users\yigit\anaconda3\Lib\site-packages\numpy\lib\function_base.py:2889: RuntimeWarning: Degrees of freedom <= 0 for slice
  c = cov(x, y, rowvar, dtype=dtype)
C:\Users\yigit\anaconda3\Lib\site-packages\numpy\lib\function_base.py:2748: RuntimeWarning: divide by zero encountered in divide
  c *= np.true_divide(1, fact)
C:\Users\yigit\anaconda3\Lib\site-packages\numpy\lib\function_base.py:2748: RuntimeWarning: invalid value encountered in multiply
  c *= np.true_divide(1, fact)

title
'Til There Was You (1997)                0.872872
1-900 (1994)                            -0.645497
101 Dalmatians (1996)                    0.211132
12 Angry Men (1957)                      0.184289
187 (1997)                               0.027398
                                           ...
Young Guns II (1990)                     0.228615
Young Poisoner's Handbook, The (1995)   -0.007374
Zeus and Roxanne (1997)                  0.818182
unknown                                  0.723123
√Å k√∂ldum klaka (Cold Fever) (1994)            NaN
Length: 1664, dtype: float64

In [22]:
corr_starwars=pd.DataFrame(similar_to_starwars,columns=["Correlation"])
corr_starwars.dropna(inplace=True)
corr_starwars.head()

                           Correlation
title
'Til There Was You (1997)     0.872872
1-900 (1994)                 -0.645497
101 Dalmatians (1996)         0.211132
12 Angry Men (1957)           0.184289
187 (1997)                    0.027398

In [24]:
# dataframe i sƒ±ralayalƒ±m en √ºstte √ßƒ±kan deƒüer starwars filmine en yakƒ±n deƒüer olacaktƒ±r.
corr_starwars.sort_values(by="Correlation",ascending=False).head(10)

                                                    Correlation
title
Hollow Reed (1996)                                          1.0
Commandments (1997)                                         1.0
Cosi (1996)                                                 1.0
No Escape (1994)                                            1.0
Stripes (1981)                                              1.0
Star Wars (1977)                                            1.0
Man of the Year (1995)                                      1.0
Beans of Egypt, Maine, The (1994)                           1.0
Old Lady Who Walked in the Sea, The (Vieille qu...          1.0
Outlaw, The (1943)                                          1.0

G√∂r√ºld√ºƒü√º gibi alakasƒ±z sonu√ßlar √ßƒ±ktƒ±, bu konuyu biraz ara≈ütƒ±rƒ±nca bunun nedeninin bu filmlerin √ßok az oy almasƒ± nedeniyle olduƒüunu buluyoruz. Bu durumu d√ºzeltmek i√ßin 100'den az oy alan filmleri eleyelim.. Bu ama√ßla ratings isimli bir dataframe olu≈üturalƒ±m ve burada her fiminka√ß tane oy aldƒ±ƒüƒ±nƒ± tutalƒ±m.

In [25]:
df.head()

   user_id  item_id  rating  timestamp                            title
0        0       50       5  881250949                 Star Wars (1977)
1        0      172       5  881250949  Empire Strikes Back, The (1980)
2        0      133       1  881250949        Gone with the Wind (1939)
3      196      242       3  881250949                     Kolya (1996)
4      186      302       3  891717742         L.A. Confidential (1997)

In [27]:
df.drop(["timestamp"],axis=1)

        user_id  item_id  rating                            title
0             0       50       5                 Star Wars (1977)
1             0      172       5  Empire Strikes Back, The (1980)
2             0      133       1        Gone with the Wind (1939)
3           196      242       3                     Kolya (1996)
4           186      302       3         L.A. Confidential (1997)
...         ...      ...     ...                              ...
99998       880      476       3     First Wives Club, The (1996)
99999       716      204       5        Back to the Future (1985)
100000      276     1090       1                    Sliver (1993)
100001       13      225       2            101 Dalmatians (1996)
100002       12      203       3                Unforgiven (1992)

[100003 rows x 4 columns]

In [28]:
# her filmin orlama raiting deƒüeri:
raitings=pd.DataFrame(df.groupby("title")["rating"].mean())

# sƒ±ralayalƒ±m
raitings.sort_values("rating",ascending=False).head()

                                            rating
title
They Made Me a Criminal (1939)                 5.0
Marlene Dietrich: Shadow and Light (1996)      5.0
Saint of Fort Washington, The (1993)           5.0
Someone Else's America (1995)                  5.0
Star Kid (1997)                                5.0

In [29]:
# filmin oy sayƒ±larƒ±nƒ± g√∂z √∂n√ºnde bulundurmadƒ±ƒüƒ±mƒ±z i√ßin sa√ßma sonu√ßlar √ßƒ±ktƒ±
# oylama sayƒ±sƒ±nƒ±da dikkate alalƒ±m
raitings["raiting_oy_sayisi"]=pd.DataFrame(df.groupby("title")["rating"].count())
raitings.head()

                             rating  raiting_oy_sayisi
title
'Til There Was You (1997)  2.333333                  9
1-900 (1994)               2.600000                  5
101 Dalmatians (1996)      2.908257                109
12 Angry Men (1957)        4.344000                125
187 (1997)                 3.024390                 41

In [30]:
raitings.sort_values("raiting_oy_sayisi",ascending=False)

                                      rating  raiting_oy_sayisi
title
Star Wars (1977)                    4.359589                584
Contact (1997)                      3.803536                509
Fargo (1996)                        4.155512                508
Return of the Jedi (1983)           4.007890                507
Liar Liar (1997)                    3.156701                485
...                                      ...                ...
Great Day in Harlem, A (1994)       5.000000                  1
Other Voices, Other Rooms (1997)    3.000000                  1
Good Morning (1971)                 1.000000                  1
Girls Town (1996)                   3.000000                  1
√Å k√∂ldum klaka (Cold Fever) (1994)  3.000000                  1

[1664 rows x 2 columns]

In [31]:
corr_starwars.head()

                           Correlation
title
'Til There Was You (1997)     0.872872
1-900 (1994)                 -0.645497
101 Dalmatians (1996)         0.211132
12 Angry Men (1957)           0.184289
187 (1997)                    0.027398

In [32]:
corr_starwars=corr_starwars.join(raitings["raiting_oy_sayisi"])
corr_starwars.head()

                           Correlation  raiting_oy_sayisi
title
'Til There Was You (1997)     0.872872                  9
1-900 (1994)                 -0.645497                  5
101 Dalmatians (1996)         0.211132                109
12 Angry Men (1957)           0.184289                125
187 (1997)                    0.027398                 41

In [34]:
corr_starwars[corr_starwars['raiting_oy_sayisi']>100].sort_values("Correlation",ascending=False)

,Correlation,raiting_oy_sayisi
title,,
Star Wars (1977),1.000000,584
"Empire Strikes Back, The (1980)",0.748353,368
Return of the Jedi (1983),0.672556,507
Raiders of the Lost Ark (1981),0.536117,420
Austin Powers: International Man of Mystery (1997),0.377433,130
...,...,...
"Edge, The (1997)",-0.127167,113
As Good As It Gets (1997),-0.130466,112
Crash (1996),-0.148507,128
G.I. Jane (1997),-0.176734,175
"First Wives Club, The (1996)",-0.194496,160